pioter77/esp32_rf_platform/src/main.cpp

#include <Arduino.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Wire.h>
#include <TinyGPS++.h>
#include <SPI.h>
#include <SdFat.h>
#include <uRTCLib.h>
#include <nRF24L01.h>
#include <RF24.h>

/*
trzeba przerobic tak by menu bylo struktura kazda struktora z wlasnym poem na zmienna na nazwe i zmienna na opcje ktore submenu ma zawierac potem
trzeba tez zrobic tablice tych struktur ta tablica bedzie przechowywac te glowne menu rowsy i kazdy row bedzie struktura- elementem tablicy struktur 
i tylko zmienne sie bedzie wybierac i podawac funcji wyswietlajacej ktora tez naezy przerobic
*/
#define SD_CS_PIN SS
#define OLED_ADDR   0x3C
#define BTN1 33 //d3
#define BTN2 32 //d4
#define BTN3 27 //d5 do d8

//kolejnosc menu row
#define MENU_ORDER_RTC 2
#define MENU_ORDER_GPS 1
#define MENU_ORDER_SLIDER 0
#define MENU_ORDER_NRF24 3
#define MENU_ORDER_HC05 4
#define MENU_ORDER_RF 5
#define MENU_ORDER_EMPTY1 6
#define MENU_ORDER_EMPTY2 7

#define DEL_BTN 550
#define OLED_RESET 4

#define GPS_BAUD 9600
#define RXD2 16
#define TXD2 17
//#define del_encoder 250

int val;
int ac_cursor_pos=0;
int pinA_last;
int n=LOW;

int menu_rows=8;
int menu_vertical_space=63-8+1;
int menu_slider_height=1;
byte counter1=1;
unsigned long time_last_buton1_pressed=0;
unsigned long time_last_buton2_pressed=0;
unsigned long time_last_buton3_pressed=0;
unsigned long time_last_nrf_sent=0;

//int ac_cursor_pos_prev=ac_cursor_pos;
volatile bool flag3=0;//right button pressed flag
volatile bool flag1=0;//left button pressed flag
volatile bool flag2=0;//middle button pressed flag
volatile bool flag4=0;//screen refresh need flag
bool flag_submenu=0;
bool flag_horizontal_slider1=0; //for incrementation when i n submenu 
int counter_submenu=1;
int submenu_slid_pos=0; //slider for submenu value max allowed 119

//portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;  //for interrupts on esp32

struct menu_bar{
  byte position;  //to sort things to allow to display in proper order
  char txt[];
  byte submenu_t;
};

struct time_struct{

uint8_t rtc_day,rtc_month, rtc_hour, rtc_minutes,rtc_seconds;
uint8_t rtc_year;
};

struct time_struct time_holder={0,0,0,0,0,0};

struct gps_struct
{
  bool gps_last_pos_succ,gps_last_date_succ,gps_last_time_succ;
  double gps_lati,gps_longi,gps_alti;
  uint8_t gps_day,gps_month,gps_hour,gps_minutes,gps_seconds;
  uint16_t gps_year;
}gps_holder{0,0,0,0,0,0,0,0,0,0,0,0};

struct nrf_struct
{
  const uint64_t pipe1;
  const char txt[6];
  bool status;
}nrf_holder{0xE8E8F0F0E1LL,"12",0};



//global variables for gps readouts clarity


double gps_lati=0;
double gps_longi=0;
double gps_alti=0;

uint8_t gps_day=0;
uint8_t gps_month=0;
uint16_t gps_year=0;

uint8_t gps_hour=0;
uint8_t gps_minutes=0;
uint8_t gps_seconds=0;
void IRAM_ATTR isr1()
{

flag1=1;
Serial.println("inter1");
}

void IRAM_ATTR isr2()
{

flag2=1;
Serial.println("inter2");
//flag2=0;

}

void IRAM_ATTR isr3()
{

flag3=1;
Serial.println("inter3");
}

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void menu_display();
int menu_slider_calc(int *rows,int *vert_space);
void menu_row(int lp,const char txt[],int x_start,int *actual_pos);
void submenu_type1(int *select,int *slider_pos);
void submenu_display(int option);
void submenu_type_def(int *select);
void submenu_rtc(int *select,time_struct *ts);
void submenu_gps(int *select, gps_struct *gs);
void submenu_nrf(int *select, nrf_struct *ns);
bool gps_values_read(uint8_t selector,gps_struct *gs);
//void submenu_logic_fcn(byte *actual_row_posit,int *actual_submenu_pos);
void submenu_logic_fcn(byte *actual_row_posit,int *actual_submenu_pos, gps_struct *gs,time_struct *ts,nrf_struct *ns);
bool log_maker(byte selector,const char *filename,gps_struct *gs,time_struct *ts,nrf_struct *ns);
bool nrf_send_fcn(nrf_struct *ns,unsigned long *prev_time);


void rtc_read_fcn(time_struct *ts);
bool save_value_to_sd(double value,const char *filename,bool new_line);
bool save_char_to_sd(char *txt,const char *filename,bool new_line);
//bool gps_values_read(uint8_t selector,double *lati,double *longi,double *alti,uint8_t *day,uint8_t *month,uint16_t *year,uint8_t *hour,uint8_t *minutes,uint8_t *sec);

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

File myFile;
TinyGPSPlus gps;
uRTCLib rtc;
SdFat SD;
Adafruit_SSD1306 OLED(128,64,&Wire,OLED_RESET);
RF24 radio(13,12);  //chip enable csn d8 d2

void setup() {
  Serial.begin(115200);
  Serial.println("Basic Encoder Test:");
  Serial2.begin(GPS_BAUD, SERIAL_8N1, RXD2, TXD2); //for gps communication
  rtc.set_rtc_address(0x68);
	rtc.set_model(URTCLIB_MODEL_DS3231);
  menu_slider_height=menu_slider_calc(&menu_rows,&menu_vertical_space);
  while(!SD.begin(SD_CS_PIN,SD_SCK_MHZ(10)))
    Serial.println("sd initialization failed!");
    
  
  Serial.println("sd initialization done.");
//inicjalizacja przuciskow do obslugi
  pinMode(BTN1,INPUT_PULLUP);
  pinMode(BTN2,INPUT_PULLUP);
  pinMode(BTN3,INPUT_PULLUP);
 //3 piny na przerwaniach
  attachInterrupt(digitalPinToInterrupt(BTN1),isr1,FALLING);
  attachInterrupt(digitalPinToInterrupt(BTN2),isr2,FALLING);
  attachInterrupt(digitalPinToInterrupt(BTN3),isr3,FALLING);
//przygotowanie wyswietlacza do bootowania
  OLED.begin(SSD1306_SWITCHCAPVCC,OLED_ADDR);
  OLED.clearDisplay();
  OLED.setFont(NULL);
  OLED.setTextWrap(false);
  OLED.setTextSize(1);
  OLED.setTextColor(WHITE);
  flag4=1; 
 //Serial.println(menu_slider_height);
 radio.begin(); //begin rf24 operation
}

void loop()
{
  
  unsigned long ac_time=millis();   // for calculating time delays, actual time value

 // flag1_1=(flag1 && ac_time-time_last_buton1_pressed>DEL_BTN)  ? 1:0;
  //flag2_2=(flag2 && ac_time-time_last_buton2_pressed>DEL_BTN)  ? 1:0;
  //flag3_3=(flag3 && ac_time-time_last_buton3_pressed>DEL_BTN)  ? 1:0;

  if(flag1 && ac_time-time_last_buton1_pressed>DEL_BTN)
  {
    flag1=0;
    flag4=1;  //display needs refresh when 1
      if(!flag_submenu)
      { //this happens when user isnt inside submenu main menu scrolling
        ac_cursor_pos-=8;
        counter1--;
        if(ac_cursor_pos<0) 
          {
          ac_cursor_pos=0;
          counter1=1;
          }
        Serial.println(ac_cursor_pos);  //for debugging
      }else if(flag_horizontal_slider1 && flag_submenu) //when select button was pressed when on slider, slider active need to move it
      {
        submenu_slid_pos-=8;
      }else{
        counter_submenu--;  //move through  submenu items
      }
    time_last_buton1_pressed=millis(); // important to prevent oscillations fro mbutton pressing
  }

/////////////////////////////////////////////////////////////////////////////////////middle button
   if(flag2 && ac_time-time_last_buton2_pressed>DEL_BTN)
  {
    flag2=0;
    flag4=1;

    //w to wejdzie jak f-submenu=0 wiec jako wcisniemy srdokowy bedac w menu glownym
   if(!flag_submenu) //when flag sumbmenu 0
   {
    flag_submenu=1; //to get into submenu
    Serial.println("flag submenu");
    Serial.println(flag_submenu);
   }else//ten else musi tu byc bo bez tego po wlaczeniu submenu od razu  by z miego wyszedl
  //if(flag_submenu)
  {//to obśługa srodkowego przycisku bedac w submenu jakims
    //Serial.println("inside");

