pioter77/esp32_rf_platform/src/main.cpp
  /////////////////////////////////////////funkcja logiki poruszania po menu selecta srodkowego przycisku
  submenu_logic_fcn(&counter1,&counter_submenu,&gps_holder,&time_holder,&nrf_holder);

  }
     

   // Serial.println(ac_cursor_pos);

     
   time_last_buton2_pressed=millis();
    //interrupts();
     //portEXIT_CRITICAL(&mux);
  }
/////////////////////////////////////////////////////////////////////////////////////
   if(flag3 && ac_time-time_last_buton3_pressed>DEL_BTN)
  {
     flag3=0;
    flag4=1;

  if(!flag_submenu)
  {
    ac_cursor_pos+=8;
    counter1++;
     if(ac_cursor_pos>56)//jakby zmieniac ilosc plansz to to by ptrzeba bylo razy 2 dla 2giej planszy?
     { ac_cursor_pos=56;//albo dac flage drugiej planszy na 1 chyba lepsze rozwiazanie i potem menu_display na podstawie tej flagi wielkosci bedzie odpowedniego ifa wyswietlac
     counter1=8;
     }
     Serial.println(ac_cursor_pos);
  }else if(flag_horizontal_slider1 && flag_submenu)
  {
    submenu_slid_pos+=8;
  }else{
        counter_submenu++;

  }
  
    
   time_last_buton3_pressed=millis();
   // interrupts();
    //portEXIT_CRITICAL(&mux);
  }

 
  
  if(flag4)
  {
    if(!flag_submenu)
    {
      menu_display();
    }else{
      submenu_display(counter1);
    }
 flag4=0;

 //////////////////////////////////////test///////////////////////////////////////////////////////////////


        ////////////////////////////////////time block/////////////////////////////////////
    //rtc_read_fcn(&time_holder);

   // flag=0;
  //interrupts();


  }
/////////////////////////////////////end test//////////////////////////////////////////////
}




int menu_slider_calc(int *rows,int *vert_space)
{
  int ret=(*vert_space/ *rows<1) ? 1: *vert_space/ *rows;
  return ret;
}
/*displays a main menu row
place--text to display--x start write position--actual cursor position for inverting colour*/
void menu_row( int lp,const char txt[],int x_start,int *actual_pos)
{
  int y_tmp=(lp==0 || lp%8==0)  ? 0:(lp*8);

  if(lp==*actual_pos/8)//wybrana wiec podswietlic bo na tej opcje najechalismy
  {
    OLED.fillRect(0,ac_cursor_pos,110,9,WHITE);
    OLED.setTextColor(BLACK);
    OLED.setCursor(x_start,y_tmp);
    OLED.println(txt);
    OLED.setTextColor(WHITE);
  }else{
    OLED.setCursor(x_start,y_tmp);
    OLED.println(txt);
  }
 
}
/*main function to display things on the oled screen
takes no parameters for now*/
void menu_display(void)
{
    OLED.clearDisplay();

  OLED.setCursor(64,0);
  OLED.println(ac_cursor_pos);
  //OLED.setCursor(0,8);
  //OLED.println(counter1);
  OLED.setCursor(111,0);
  OLED.println(counter1);
  OLED.setCursor(117,0);
  OLED.println("/");
  OLED.setCursor(123,0);

  OLED.println(8);
  OLED.drawLine(126,8,126,63,WHITE);
  OLED.drawRect(125,counter1*7+1,3,menu_slider_height,WHITE);



  menu_row(MENU_ORDER_SLIDER,"slider",0,&ac_cursor_pos);
  menu_row(MENU_ORDER_RTC,"rtc",0,&ac_cursor_pos);
  menu_row(MENU_ORDER_GPS,"gps",0,&ac_cursor_pos);
  menu_row(MENU_ORDER_NRF24,"NRF24",0,&ac_cursor_pos);
  menu_row(MENU_ORDER_HC05,"HC_12",0,&ac_cursor_pos);
  menu_row(MENU_ORDER_RF,"RF",0,&ac_cursor_pos);
  menu_row(MENU_ORDER_EMPTY1,"empty1",0,&ac_cursor_pos);
  menu_row(MENU_ORDER_EMPTY2,"empty2",0,&ac_cursor_pos);
  


 OLED.display(); //output 'display buffer' to screen  
}
/*function for displaying submenus scontent
takes number of the submenu to display
for now--1 slider menu--2 rtc time and date set/display--other default empty submenu*/
void submenu_display(int option)
{
  switch (option)
  {//+1 bo counter 1 dziala na zakresie od 1 a ordery sa od zera
    case MENU_ORDER_SLIDER+1:
    submenu_type1(&counter_submenu,&submenu_slid_pos);
    break;
    case MENU_ORDER_RTC+1:
    submenu_rtc(&counter_submenu,&time_holder);
    break;
    case MENU_ORDER_GPS+1:
    submenu_gps(&counter_submenu,&gps_holder);
    break;
    case MENU_ORDER_NRF24+1:
    submenu_nrf(&counter_submenu,&nrf_holder);
    break;
    default:
   // Serial.println("err occured i nsubmenu");
    submenu_type_def(&counter_submenu);
  }
  
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void submenu_type1(int *select,int *slider_pos)
{
  if(*select>3) *select=1;
  if(*select<1) *select=3;

  //protect value of slider from exceeding limit
  *slider_pos=(*slider_pos>120) ? 120:*slider_pos;
  *slider_pos=(*slider_pos<0) ? 0 :*slider_pos;
  OLED.clearDisplay();

  OLED.setCursor(0,10);
  OLED.println("eg vert slider 1");

  OLED.drawLine(0,40,127,40,WHITE);

  switch(*select)
  {    
    case 3: //slider 
    if(flag_horizontal_slider1) OLED.drawRect(*slider_pos+3,37,2,7,WHITE);

      OLED.drawRect(*slider_pos,39,8,3,WHITE);
      OLED.setCursor(20,25);
      OLED.println("exit");
      OLED.setCursor(80,25);
      OLED.println("OK");
    
      break;
    case 2: //ok btn
      OLED.drawRect(*slider_pos,39,8,3,WHITE);
      OLED.setCursor(20,25);
      OLED.println("exit");
      OLED.fillRect(79,24,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(80,25);
      OLED.println("OK");
      OLED.setTextColor(WHITE);
      break;

    default: //jka jeden exit musi byc jako default
      OLED.drawRect(*slider_pos,39,8,3,WHITE);
      OLED.fillRect(19,24,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(20,25);
      OLED.println("exit");
      OLED.setTextColor(WHITE);
      OLED.setCursor(80,25);
      OLED.println("OK");
  }

  OLED.display(); //output 'display buffer' to screen  
}

void submenu_rtc(int *select,time_struct *ts)
{
  const uint8_t sec_line=9,trd_line=19;
  //const for positioning buttons
  const uint8_t y_but_level=55;
  const uint8_t x_first_btn=1;
  const uint8_t x_sec_btn=32;
  const uint8_t x_rd_btn=63;
  //thxt in buttons
  const char btn1_t[]= "exit";
  const char btn2_t[]="set";
  const char btn3_t[]="F5";
  //rtc_read_fcn(ts); //update struct values 
  OLED.clearDisplay();

  OLED.setCursor(0,0);
  OLED.println("time menu");

  if(*select>3) *select=3;
  if(*select<1) *select=1;
  //date printout
  OLED.setCursor(0,sec_line);
  OLED.println("date");
  OLED.setCursor(25,sec_line);
  OLED.println(ts->rtc_day);
  OLED.setCursor(36,sec_line);
  OLED.println(".");
  OLED.setCursor(41,sec_line);
  OLED.println(ts->rtc_month);
  OLED.setCursor(51,sec_line);
  OLED.println(".");
  OLED.setCursor(56,sec_line);
  OLED.println(ts->rtc_year);
  //time printout
  OLED.setCursor(0,trd_line);
  OLED.println("time");
  OLED.setCursor(25,trd_line);
  OLED.println(ts->rtc_hour);
  OLED.setCursor(36,trd_line);
  OLED.println(":");
  OLED.setCursor(41,trd_line);
  OLED.println(ts->rtc_minutes);
  OLED.setCursor(51,trd_line);
  OLED.println(":");
  OLED.setCursor(56,trd_line);
  OLED.println(ts->rtc_seconds);

