pioter77/esp32_rf_platform/src/main.cpp
  //button display
     switch(*select)
  {       
    case 3: //refresh gps readout btn
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.fillRect(x_rd_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
      OLED.setTextColor(WHITE);
      break;
    case 2: //save btn
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.fillRect(x_sec_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.setTextColor(WHITE);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
      break;

    default: //jka jeden exit musi byc jako default
      OLED.fillRect(x_first_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.setTextColor(WHITE);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
  }
OLED.display(); //output 'display buffer' to screen  
}
void submenu_gps(int *select, gps_struct *gs)
{
  if(*select>3) *select=1;
  if(*select<1) *select=3;

  //values dror buttons positioning
  const uint8_t y_but_level=55;
  const uint8_t x_first_btn=1;
  const uint8_t x_sec_btn=32;
  const uint8_t x_rd_btn=63;

  const uint8_t y_readout_pos=9;
  const uint8_t x_readout_pos=0;
  const uint8_t x_shift=40;
  const uint8_t y_shift=10;
   //thxt in buttons
  const char btn1_t[]= "exit";
  const char btn2_t[]="save";
  const char btn3_t[]="F5";
  const char err_msg[]="not found";

  OLED.clearDisplay();
  //main title
  OLED.setCursor(0,0);
  OLED.println("gps menu");

  OLED.setCursor(x_readout_pos,y_readout_pos);
  OLED.println("lat:");
  OLED.setCursor(x_readout_pos+x_shift,y_readout_pos);
  if(gs->gps_last_pos_succ){
    OLED.println(gs->gps_lati);
  }else{
    OLED.println(err_msg);
  }
  OLED.setCursor(x_readout_pos,y_readout_pos+y_shift);
  OLED.println("long:");
  OLED.setCursor(x_readout_pos+x_shift,y_readout_pos+y_shift);
  if(gs->gps_last_pos_succ){
    OLED.println(gs->gps_longi);
  }else{
    OLED.println(err_msg);
  }
  OLED.setCursor(x_readout_pos,y_readout_pos+2*y_shift);
  OLED.println("alt:");
  OLED.setCursor(x_readout_pos+x_shift,y_readout_pos+2*y_shift);
  if(gs->gps_last_pos_succ)
  {
    OLED.println(gs->gps_alti);
  }else{
    OLED.println(err_msg);
  }
  //buttons display
    switch(*select)
  {       
    case 3: //refresh gps readout btn
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.fillRect(x_rd_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
      OLED.setTextColor(WHITE);
      break;
    case 2: //save btn
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.fillRect(x_sec_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.setTextColor(WHITE);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
      break;

    default: //jka jeden exit musi byc jako default
      OLED.fillRect(x_first_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.setTextColor(WHITE);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
  }
  OLED.display(); //output 'display buffer' to screen  
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void submenu_type_def(int *select){
  OLED.clearDisplay();

  OLED.setCursor(0,10);
  OLED.println("blank menu");

  if(*select>1) *select=1;
  if(*select<1) *select=1;
    OLED.fillRect(19,24,30,9,WHITE);
    OLED.setTextColor(BLACK);
    OLED.setCursor(20,25);
    OLED.println("exit");
    OLED.setTextColor(WHITE);

    OLED.display(); //output 'display buffer' to screen  
}
/*selector:1->location 2->date 3->time---&global gps structure name
should be used to save retrurned value to first 3 variables in gps_structure if 0 the readout was wrong!*/
bool gps_values_read(uint8_t selector,gps_struct *gs)
{
  bool tmp_flag=0;
   while (Serial2.available() > 0)
    if(gps.encode(Serial2.read())) tmp_flag=1;
    if(!tmp_flag) return 0;

  switch (selector)
  {
    case 1:
      if (!gps.location.isValid()) return 0;
      gs->gps_lati=gps.location.lat();
      gs->gps_longi=gps.location.lng();
      gs->gps_alti=gps.altitude.meters();
    return 1;
   
    case 2:
      if (!gps.date.isValid()) return 0;
      gs->gps_month=gps.date.month();
      gs->gps_day=gps.date.day();
      gs->gps_year=gps.date.year();
    return 1;

    case 3:
       if (!gps.time.isValid()) return 0;
      gs->gps_hour=gps.time.hour();
      gs->gps_minutes=gps.time.minute();
      gs->gps_seconds=gps.time.second();
    return 1;

    default:
    return 0;
  }
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
bool save_char_to_sd(char *txt,const char *filename,bool new_line)
{

  myFile = SD.open(filename, FILE_WRITE);
  if(myFile)
  {
    if(new_line)
    {
      myFile.println(txt);
    }else{
      myFile.print(txt);
    }

    myFile.close();
    return 1;//file opened succesfully and text written to it
  }
  return 0;//file opening error
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
bool save_value_to_sd(double value,const char *filename,bool new_line)
{

