pioter77/esp32_rf_platform/src/main.cpp
  myFile = SD.open(filename, FILE_WRITE);
  if(myFile)
  {
    if(new_line)
    {
      myFile.println(value);
    }else{
      myFile.print(value);
    }

    myFile.close();
    return 1;//file opened succesfully and text written to it
  }
  return 0;//file opening error
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void rtc_read_fcn(time_struct *ts)
{

 //Serial.print("RTC DateTime: ");
  rtc.refresh();
 ts->rtc_day=rtc.day();
 ts->rtc_month=rtc.month();
 ts->rtc_year=rtc.year();

 ts->rtc_hour=rtc.hour();
 ts->rtc_minutes=rtc.minute();
 ts->rtc_seconds=rtc.second();
	
}

//counter1, counter_submenu to jest funcka obslugujaca logkige wcisniec srodkowego przycisku dla poszeglonych submenu rozniacych sie przyciskami
//trzeba zrobi strukture struct menu_curs_n_flags i ona bedzie miec wszystkie cursory globalne i flagi słuzace do oreintacji i logiki w menu oprocz? flag od przerwan
void submenu_logic_fcn(byte *actual_row_posit,int *actual_submenu_pos, gps_struct *gs,time_struct *ts,nrf_struct *ns)
{
  //counter1
  if(*actual_row_posit==MENU_ORDER_SLIDER+1)
  {
      //menu slider logic
    switch (counter_submenu)  //&& counter1 1-8
    {
      case 2://ok button
        flag_submenu=0;
        flag_horizontal_slider1=0;//get back to operate on vertical slider values
      break;

      case 3: //get off/in the slider selection to control buttons/to control slider
        flag_horizontal_slider1=!flag_horizontal_slider1; //bez tego odwracania wartosci by sie nie dal owysjc
      break;

      default: //when 1 thats exit
      flag_submenu=0;
      flag_horizontal_slider1=0;//get back to operate on vertical slider values
    }
  }
  else if(*actual_row_posit==MENU_ORDER_GPS+1)
  {
          //menu gps logic
    switch (counter_submenu)  //&& counter1 1-8
    {
      case 2://save button
       // flag_submenu=0;
        //flag_horizontal_slider1=0;//get back to operate on vertical slider values
      log_maker(1,"log_gps_submenu.csv",&gps_holder,&time_holder,&nrf_holder);
         
      break;

      case 3: //refresh //po winien flage ze struktury zmienic na 1 i wywlac funcke robiaca odczyt do stuktury gps i zerujacej ta flage
        //flag_horizontal_slider1=!flag_horizontal_slider1; //bez tego odwracania wartosci by sie nie dal owysjc
        flag4=1; //refresh the screen
       // flag_submenu=1;
        gs->gps_last_pos_succ=gps_values_read(1,&gps_holder);
        gs->gps_last_date_succ=gps_values_read(2,&gps_holder);
        gs->gps_last_time_succ=gps_values_read(3,&gps_holder);
        //debug:
        Serial.println("gps readout refresh:");
        Serial.println(gs->gps_lati);
        Serial.println(gs->gps_longi);
        Serial.println(gs->gps_alti);
         Serial.println(gs->gps_day);
        Serial.println(gs->gps_month);
        Serial.println(gs->gps_year);
         Serial.println(gs->gps_hour);
        Serial.println(gs->gps_minutes);
        Serial.println(gs->gps_seconds);
       // flag_horizontal_slider1=0;
      break;

      default: //when 1 thats exit
      flag_submenu=0;
      flag_horizontal_slider1=0;//get back to operate on vertical slider values
    }
  }
  else if(*actual_row_posit==MENU_ORDER_RTC+1)
  {   //tylko exit na ten moment
        switch (counter_submenu)  //&& counter1 1-8
    {
      case 2://set button
        flag_submenu=0;
        flag_horizontal_slider1=0;//get back to operate on vertical slider values
      break;

      case 3: //refresh button
      flag4=1;    //express the nedd for refrshing screen
      rtc_read_fcn(ts); //update struct values 
      //flag_horizontal_slider1=0;//get back to operate on vertical slider values      break;
      //flag_submenu=0;
      break;

      default: //when 1 thats exit
      flag_submenu=0;
      flag_horizontal_slider1=0;//get back to operate on vertical slider values
    }
  }
  else if(*actual_row_posit==MENU_ORDER_NRF24+1)
  {
          //menu gps logic
    switch (counter_submenu)  //&& counter1 1-8
    {
      case 2://save button
       // flag_submenu=0;
        //flag_horizontal_slider1=0;//get back to operate on vertical slider values
          gs->gps_last_pos_succ=gps_values_read(1,&gps_holder);
        gs->gps_last_date_succ=gps_values_read(2,&gps_holder);
        gs->gps_last_time_succ=gps_values_read(3,&gps_holder);
      log_maker(2,"log_nrf24_submenu.csv",&gps_holder,&time_holder,&nrf_holder);
         
      break;

      case 3: //refresh //po winien flage ze struktury zmienic na 1 i wywlac funcke robiaca odczyt do stuktury gps i zerujacej ta flage
        //flag_horizontal_slider1=!flag_horizontal_slider1; //bez tego odwracania wartosci by sie nie dal owysjc
        flag4=1; //refresh the screen
       // flag_submenu=1;
      nrf_send_fcn(&nrf_holder,&time_last_nrf_sent);
        //debug:
    
       // flag_horizontal_slider1=0;
      break;

      default: //when 1 thats exit
      flag_submenu=0;
      flag_horizontal_slider1=0;//get back to operate on vertical slider values
    }
  }
  else
  {
    //when only exit in menu or not defined function yet exit case 
      flag_submenu=0;
      flag_horizontal_slider1=0;//get back to operate on vertical slider values
  }
  
}

bool log_maker(byte selector,const char *filename,gps_struct *gs,time_struct *ts,nrf_struct *ns)
{
  switch (selector)
  {
    case 1://gps menu log call
      gs->gps_last_pos_succ=gps_values_read(1,&gps_holder);
      gs->gps_last_date_succ=gps_values_read(2,&gps_holder);
      gs->gps_last_time_succ=gps_values_read(3,&gps_holder);
      rtc_read_fcn(ts);


      myFile = SD.open(filename, FILE_WRITE);
      if(myFile)
      {
        //rtc date
        myFile.print(ts->rtc_day);
        myFile.print(";");
        myFile.print(ts->rtc_month);
        myFile.print(";");
        myFile.print(ts->rtc_year);
        myFile.print(";");
        //rtc time
        myFile.print(ts->rtc_hour);
        myFile.print(";");
        myFile.print(ts->rtc_minutes);
        myFile.print(";");
        myFile.print(ts->rtc_seconds);
        myFile.print(";");
        //gps position
        myFile.print(gs->gps_last_pos_succ);
        myFile.print(";");
        myFile.print(gs->gps_lati);
        myFile.print(";");
        myFile.print(gs->gps_longi);
        myFile.print(";");
        myFile.print(gs->gps_alti);
        myFile.print(";");
        //gps date
        myFile.print(gs->gps_last_date_succ);
        myFile.print(";");
        myFile.print(gs->gps_day);
        myFile.print(";");
        myFile.print(gs->gps_month);
        myFile.print(";");
        myFile.print(gs->gps_year);
        myFile.print(";");
        //gps time
        myFile.print(gs->gps_last_time_succ);
        myFile.print(";");
        myFile.print(gs->gps_hour);
        myFile.print(";");
        myFile.print(gs->gps_minutes);
        myFile.print(";");
        myFile.print(gs->gps_seconds);
        myFile.println(";");

        myFile.close();
        return 1;//file opened succesfully and text written to it
      }
    case 2://nrf24 menu log call
      gs->gps_last_pos_succ=gps_values_read(1,&gps_holder);
      gs->gps_last_date_succ=gps_values_read(2,&gps_holder);
      gs->gps_last_time_succ=gps_values_read(3,&gps_holder);
      rtc_read_fcn(ts);


