pioter77/esp32_rf_platform/src/main.cpp
      myFile = SD.open(filename, FILE_WRITE);
      if(myFile)
      {
        //rtc date
        myFile.print(ts->rtc_day);
        myFile.print(";");
        myFile.print(ts->rtc_month);
        myFile.print(";");
        myFile.print(ts->rtc_year);
        myFile.print(";");
        //rtc time
        myFile.print(ts->rtc_hour);
        myFile.print(";");
        myFile.print(ts->rtc_minutes);
        myFile.print(";");
        myFile.print(ts->rtc_seconds);
        myFile.print(";");
        //gps position
        myFile.print(gs->gps_last_pos_succ);
        myFile.print(";");
        myFile.print(gs->gps_lati);
        myFile.print(";");
        myFile.print(gs->gps_longi);
        myFile.print(";");
        myFile.print(gs->gps_alti);
        myFile.print(";");
        //gps date
        myFile.print(gs->gps_last_date_succ);
        myFile.print(";");
        myFile.print(gs->gps_day);
        myFile.print(";");
        myFile.print(gs->gps_month);
        myFile.print(";");
        myFile.print(gs->gps_year);
        myFile.print(";");
        //gps time
        myFile.print(gs->gps_last_time_succ);
        myFile.print(";");
        myFile.print(gs->gps_hour);
        myFile.print(";");
        myFile.print(gs->gps_minutes);
        myFile.print(";");
        myFile.print(gs->gps_seconds);
        myFile.println(";");
         //nrf24 status
        myFile.print(ns->status);
        myFile.print(";");
        myFile.print(ns->txt);
        myFile.println(";");

        myFile.close();
        return 1;//file opened succesfully and text written to it
      }
      default:
      return 0;//file opening error
  }
}

void submenu_nrf(int *select,nrf_struct *ns)
{
  const uint8_t sec_line=9,trd_line=19;
  //const for positioning buttons
  const uint8_t y_but_level=55;
  const uint8_t x_first_btn=1;
  const uint8_t x_sec_btn=32;
  const uint8_t x_rd_btn=63;
  //thxt in buttons
  const char btn1_t[]= "exit";
  const char btn2_t[]="log";
  const char btn3_t[]="change";
  //rtc_read_fcn(ts); //update struct values 
  OLED.clearDisplay();

  OLED.setCursor(0,0);
  OLED.println("NRF_24 menu");

  if(*select>3) *select=3;
  if(*select<1) *select=1;
  //date printout
  OLED.setCursor(0,sec_line);
  OLED.println("status:");
  OLED.setCursor(55,sec_line);
  OLED.println(ns->status);
 
  //time printout
  OLED.setCursor(0,trd_line);
  OLED.println("status:");
  OLED.setCursor(55,trd_line);
  OLED.println(ns->status);
 

  //button display
     switch(*select)
  {       
    case 3: //refresh gps readout btn
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.fillRect(x_rd_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
      OLED.setTextColor(WHITE);
      break;
    case 2: //save btn
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.fillRect(x_sec_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.setTextColor(WHITE);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
      break;

    default: //jka jeden exit musi byc jako default
      OLED.fillRect(x_first_btn-1,y_but_level-1,30,9,WHITE);
      OLED.setTextColor(BLACK);
      OLED.setCursor(x_first_btn,y_but_level);
      OLED.println(btn1_t);
      OLED.setTextColor(WHITE);
      OLED.setCursor(x_sec_btn,y_but_level);
      OLED.println(btn2_t);
      OLED.setCursor(x_rd_btn,y_but_level);
      OLED.println(btn3_t);
  }
OLED.display(); //output 'display buffer' to screen  
}

bool nrf_send_fcn(nrf_struct *ns,unsigned long *prev_time)
{
  radio.setChannel(2);
  radio.setPayloadSize(7);
  radio.setDataRate(RF24_250KBPS);
  radio.openWritingPipe(ns->pipe1);


  unsigned long tmp=millis();
  if(tmp-*prev_time>500)
  {
    radio.write(ns->txt, 6);
    ns->status=!ns->status;
    *prev_time=millis();
  }
  return 1;
}